Getting this failure:

````
 2024/10/22 21:56:03 Terraform apply | Error: ReplaceIntegrationWithContext failed Provided endpoint value is not valid.
````

But I can see the endpoint is correct:
````
2024/10/22 21:53:42 Terraform plan |   # module.event_notifications[0].ibm_en_integration.en_kms_integration[0] will be created
 2024/10/22 21:53:42 Terraform plan |   + resource "ibm_en_integration" "en_kms_integration" {
 2024/10/22 21:53:42 Terraform plan |       + id             = (known after apply)
 2024/10/22 21:53:42 Terraform plan |       + instance_guid  = (known after apply)
 2024/10/22 21:53:42 Terraform plan |       + integration_id = (known after apply)
 2024/10/22 21:53:42 Terraform plan |       + type           = "hs-crypto"
 2024/10/22 21:53:42 Terraform plan |       + updated_at     = (known after apply)
 2024/10/22 21:53:42 Terraform plan | 
 2024/10/22 21:53:42 Terraform plan |       + metadata {
 2024/10/22 21:53:42 Terraform plan |           + crn         = "crn:v1:bluemix:public:hs-crypto:us-south:a/abac0df06b644a9cabc6e44f55b3880e:e6dce284-e80f-46e1-a3c1-830f7adff7a9::"
 2024/10/22 21:53:42 Terraform plan |           + endpoint    = "https://e6dce284-e80f-46e1-a3c1-830f7adff7a9.api.private.us-south.hs-crypto.appdomain.cloud/"
 2024/10/22 21:53:42 Terraform plan |           + root_key_id = (known after apply)
 2024/10/22 21:53:42 Terraform plan |         }
 2024/10/22 21:53:42 Terraform plan |     }
````

This matches the new endpoint schema introduced recently to hyper protect.

````
https://e6dce284-e80f-46e1-a3c1-830f7adff7a9.api.private.us-south.hs-crypto.appdomain.cloud
````